#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket_public_access_block.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]
aws_s3_bucket_policy.bucket-policy: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]
aws_s3_bucket_versioning.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]
aws_s3_bucket_website_configuration.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]
aws_s3_bucket_ownership_controls.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]
aws_s3_bucket_acl.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939,public-read]
aws_s3_bucket.my-static-website: Refreshing state... [id=deploy-s3-app-angular-vapc-1098824939]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.repo will be created
  + resource "aws_ecr_repository" "repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "app_repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs will be created
  + resource "aws_ecs_cluster" "ecs" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "app_cluster"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "app_service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.td will be created
  + resource "aws_ecs_task_definition" "td" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + essential    = true
                  + image        = "056212709895.dkr.ecr.us-east-2.amazonaws.com/app_repo"
                  + memory       = 512
                  + name         = "app"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::056212709895:role/ecsTaskExecutionRole"
      + family                   = "app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::056212709895:role/ecsTaskExecutionRole"
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rt will be created
  + resource "aws_route_table" "rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.route1 will be created
  + resource "aws_route_table_association" "route1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.route2 will be created
  + resource "aws_route_table_association" "route2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.route3 will be created
  + resource "aws_route_table_association" "route3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.my-static-website will be destroyed
  # (because aws_s3_bucket.my-static-website is not in configuration)
  - resource "aws_s3_bucket" "my-static-website" {
      - arn                         = "arn:aws:s3:::deploy-s3-app-angular-vapc-1098824939" -> null
      - bucket                      = "deploy-s3-app-angular-vapc-1098824939" -> null
      - bucket_domain_name          = "deploy-s3-app-angular-vapc-1098824939.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "deploy-s3-app-angular-vapc-1098824939.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "deploy-s3-app-angular-vapc-1098824939" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Id        = "Policy"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::deploy-s3-app-angular-vapc-1098824939/*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "my-static-website"
        } -> null
      - tags_all                    = {
          - "Name" = "my-static-website"
        } -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "deploy-s3-app-angular-vapc-1098824939.s3-website-us-east-1.amazonaws.com" -> null

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "0b67cea04db7a0fbda9c4ae7b430b21b3afdd8d668621ce161c0cc76ea7bc796" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_acl.my-static-website will be destroyed
  # (because aws_s3_bucket_acl.my-static-website is not in configuration)
  - resource "aws_s3_bucket_acl" "my-static-website" {
      - acl    = "public-read" -> null
      - bucket = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id     = "deploy-s3-app-angular-vapc-1098824939,public-read" -> null

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "vperezcerveleon" -> null
                  - id           = "0b67cea04db7a0fbda9c4ae7b430b21b3afdd8d668621ce161c0cc76ea7bc796" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "vperezcerveleon" -> null
              - id           = "0b67cea04db7a0fbda9c4ae7b430b21b3afdd8d668621ce161c0cc76ea7bc796" -> null
            }
        }
    }

  # aws_s3_bucket_ownership_controls.my-static-website will be destroyed
  # (because aws_s3_bucket_ownership_controls.my-static-website is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "my-static-website" {
      - bucket = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id     = "deploy-s3-app-angular-vapc-1098824939" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # aws_s3_bucket_policy.bucket-policy will be destroyed
  # (because aws_s3_bucket_policy.bucket-policy is not in configuration)
  - resource "aws_s3_bucket_policy" "bucket-policy" {
      - bucket = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id     = "deploy-s3-app-angular-vapc-1098824939" -> null
      - policy = jsonencode(
            {
              - Id        = "Policy"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::deploy-s3-app-angular-vapc-1098824939/*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_public_access_block.my-static-website will be destroyed
  # (because aws_s3_bucket_public_access_block.my-static-website is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "my-static-website" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id                      = "deploy-s3-app-angular-vapc-1098824939" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # aws_s3_bucket_versioning.my-static-website will be destroyed
  # (because aws_s3_bucket_versioning.my-static-website is not in configuration)
  - resource "aws_s3_bucket_versioning" "my-static-website" {
      - bucket = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id     = "deploy-s3-app-angular-vapc-1098824939" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # aws_s3_bucket_website_configuration.my-static-website will be destroyed
  # (because aws_s3_bucket_website_configuration.my-static-website is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "my-static-website" {
      - bucket           = "deploy-s3-app-angular-vapc-1098824939" -> null
      - id               = "deploy-s3-app-angular-vapc-1098824939" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "deploy-s3-app-angular-vapc-1098824939.s3-website-us-east-1.amazonaws.com" -> null

      - error_document {
          - key = "index.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "https"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.sn1 will be created
  + resource "aws_subnet" "sn1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sn2 will be created
  + resource "aws_subnet" "sn2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sn3 will be created
  + resource "aws_subnet" "sn3" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 14 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  - website_url = "deploy-s3-app-angular-vapc-1098824939.s3-website-us-east-1.amazonaws.com" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*